slowbro/ledcontrol/ide-configs/hardware/avr/1.0.0/boards.txt
nanotest.name=Arduino Nano TEST

nanotest.upload.tool=avrdude
nanotest.upload.protocol=arduino

nanotest.bootloader.tool=avrdude
nanotest.bootloader.unlock_bits=0x3F
nanotest.bootloader.lock_bits=0x0F

nanotest.build.f_cpu=16000000L
nanotest.build.board=AVR_NANO
nanotest.build.core=arduino
nanotest.build.variant=eightanaloginputs

## Arduino Nano w/ ATmega328P
## --------------------------
nanotest.menu.cpu.atmega328=ATmega328P

nanotest.menu.cpu.atmega328.upload.maximum_size=30720
nanotest.menu.cpu.atmega328.upload.maximum_data_size=2048
nanotest.menu.cpu.atmega328.upload.speed=115200

nanotest.menu.cpu.atmega328.bootloader.low_fuses=0xFF
nanotest.menu.cpu.atmega328.bootloader.high_fuses=0xDA
nanotest.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
nanotest.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328.hex

nanotest.menu.cpu.atmega328.build.mcu=atmega328p

